#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/whatshark/infrastructure/runs/run-m6fqeN5789mMVydr

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.whatshark will be created
  + resource "aws_route53_zone" "whatshark" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "whatshark.com"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @WhatShark, Action: `pull_request`*